of/org/yjn2_deck_p25/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    top
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          37;
        startFace       84270;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          38;
        startFace       84307;
    }
    inlet
    {
        type            patch;
        nFaces          22;
        startFace       84345;
    }
    outlet
    {
        type            patch;
        nFaces          22;
        startFace       84367;
    }
    deck
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1080;
        startFace       84389;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          105670;
        startFace       85469;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       191139;
    }
)

// ************************************************************************* //
